7eraflops/prj23/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_WIFI_PROV_AUTOSTOP_TIMEOUT=30
CONFIG_COMPILER_CXX_EXCEPTIONS=y

# Increase flash size to 4MB to accommodate larger binaries
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Use a partition table with a larger app partition (1.5MB)
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
